[
  {
    "text": "These Affiliate Terms and Conditions (the “Agreement”) shall constitute an Agreement between you (“You” or “Affiliate”) and Daraz Bangladesh Limited (hereinafter referred to as (the “Company”) for the registration and appointment of the Affiliate to provide the Company with Promotion of the Channels. The Affiliate and the Company shall collectively be referred to as the “Parties” and individually as the “Party”."
  },
  {
    "text": "The Affiliate must read, agree to, and accept all of the terms and provisions contained in this Agreement, by clicking “I Accept” button, and the Parties hereby agree, acknowledge and accept that clicking such button shall instantly form a valid, effective and legally binding agreement for good consideration between the Parties."
  },
  {
    "text": "This Agreement constitutes the complete and exclusive statement of the agreement of both the Parties with respect to the subject matter of this Agreement, and supersedes all prior oral and written commitments, understandings, and communications between the Parties regarding such matter. The Company may, at its sole discretion, amend the Agreement, from time to time, by providing the revised version(s) of the same to the Affiliate in writing, at the sole discretion of the Company, without being required to give any prior notice to the Affiliate. Any continued performance of its obligations under this Agreement, by the Affiliate after the revised Agreement has come into effect shall be deemed as the Affiliate’s consent to such revised Agreement."
  },
  {
    "text": "WHEREAS, the Company is a leading e-commerce organization of Bangladesh which for the purpose of this Agreement is engaged in the provision of advertising services and Affiliate is willing and able to provide promotional services and content of the Channels to Customers, for the Company, for the purpose of increasing the user traffic on those Channels. The Company now engages the Affiliate, and the Affiliate accepts such engagement, to perform the Promotion of the Channels in the Territory on the terms and conditions specified herein."
  }
]
